OpenFOAM-v1806/tutorials/multiphase/overInterDyMFoam/boatAndPropeller/0.orig/p_rgh
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1806                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      p_rgh;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -2 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    #includeEtc "caseDicts/setConstraintTypes"

    "(hullWall|propellerWall|rudderWall|defaultFaces)"
    {
        type            fixedFluxPressure;
    }

   atmosphere
   {
        type            totalPressure;
        p0              uniform 0;
        U               U;
        phi             phi;
        rho             rho;
        psi             none;
        gamma           1;
        value           uniform 0;
   }
  defaultFaces
  {
      type            fixedFluxPressure;
  }
//
//    right1
//    {
//        type            fixedValue;   //calculated;
//        value           $internalField;
//    }

    "overset.*"
    {
        patchType       overset;
        type           fixedFluxPressure;
    }
}

// ************************************************************************* //
