OpenFOAM-v1806/tutorials/multiphase/overInterDyMFoam/boatAndPropeller/system/setFieldsDictWaterLevel
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1806                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      setFieldsDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

defaultFieldValues
(
    volScalarFieldValue alpha.water 0
);

regions
(
    boxToCell
    {
        box ( -100 -100 -100 ) ( 100 0.0 100 );
        fieldValues ( volScalarFieldValue alpha.water 1 );
    }

    boxToFace
    {
        box ( -100 -100 -100 ) ( 100 0.0 100 );
        fieldValues ( volScalarFieldValue alpha.water 1 );
    }

);

// ************************************************************************* //
